app/controllers/achievements_controller.rb

  def index
    @achievements = Achievement.all - Achievement.voted_on_achievements(current_user)
---
SELECT  "votes".* FROM "votes"  WHERE "votes"."achievement_id" = $1 AND "votes"."user_id" = 1 LIMIT 1  [["achievement_id", 1]]
SELECT "achievements".* FROM "achievements"  WHERE ("achievements"."user_id" != 1)

  def create
    @achievement = Achievement.new(achievement_params)
    @achievement.user_id = current_user.id
    if @achievement.save
---
INSERT INTO "achievements" ("created_at", "task", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-06-19 01:43:56.501703"], ["task", "Correct some mistakes in Rails."], ["updated_at", "2014-06-19 01:43:56.501703"], ["user_id", 1]]

  def edit
    if current_user.admin?
      @achievements = Achievement.all
---
SELECT "achievements".* FROM "achievements"

  def destroy
    if current_user.admin?
      achievement = Achievement.find(params[:id])
      achievement.destroy
---
SELECT  "achievements".* FROM "achievements"  WHERE "achievements"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "achievements" WHERE "achievements"."id" = $1  [["id", 5]]