app/controllers/votes_controller.rb

SELECT  "votes".* FROM "votes"  WHERE "votes"."user_id" = 1 AND "votes"."achievement_id" IS NULL LIMIT 1
SELECT COUNT(*) FROM "votes"  WHERE "votes"."user_id" = 1 AND "votes"."achievement_id" = 1
INSERT INTO "votes" ("achievement_id", "created_at", "updated_at", "user_id", "weighting") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["achievement_id", 5], ["created_at", "2014-06-18 23:04:45.638834"], ["updated_at", "2014-06-18 23:04:45.638834"], ["user_id", 1], ["weighting", 2]]
---
  def create
    if Vote.where(user_id: current_user.id, achievement_id: params[:vote][:achievement_id]).empty?
      vote = Vote.new(votes_params)
      vote.user_id = current_user.id
      if !vote.save